{
  "classname": "AedgK12FenestrationAndDaylightingControls",
  "name": "aedg_k12_fenestration_and_daylighting_controls",
  "display_name": "AEDG K12 Fenestration And Daylighting Controls",
  "measure_type": "RubyMeasure",
  "arguments": [
    {
      "name": "cost_daylight_glazing",
      "display_name": "Cost per Area for Proposed Daylighting Window Constructions",
      "variable_type": "Double",
      "local_variable": "cost_daylight_glazing",
      "units": "$/ft^2",
      "default_value": 0.0
    },
    {
      "name": "cost_view_glazing",
      "display_name": "Cost per Area for Proposed View Window Constructions",
      "variable_type": "Double",
      "local_variable": "cost_view_glazing",
      "units": "$/ft^2",
      "default_value": 0.0
    },
    {
      "name": "cost_skylight",
      "display_name": "Cost per Area for Proposed Skylight Construction",
      "variable_type": "Double",
      "local_variable": "cost_skylight",
      "units": "$/ft^2",
      "default_value": 0.0
    },
    {
      "name": "cost_shading_surface",
      "display_name": "Cost per Area for Proposed Exterior Shading Surface Construction",
      "variable_type": "Double",
      "local_variable": "cost_shading_surface",
      "units": "$/ft^2",
      "default_value": 0.0
    },
    {
      "name": "cost_light_shelf",
      "display_name": "Cost per Area for Proposed Light Shelf Construction",
      "variable_type": "Double",
      "local_variable": "cost_light_shelf",
      "units": "$/ft^2",
      "default_value": 0.0
    }
  ],
  "name_xml": "AEDG K12 - Fenestration and Daylighting Controls",
  "uid": "76683121-d531-46c0-8e1c-749c1ff646f0",
  "version_id": "0b0df3f6-888b-4939-a0f6-f1d456b263ab",
  "tags": [
    "Envelope.Fenestration"
  ],
  "modeler_description_xml": "This measure is intended for use in models created form space types defined in the primary and secondary building types. Other space types used in the model will not receive any new fenestration, however fenestration will be removed from all space types. Attic and plenum spaces will not receive any new fenestration. Daylighting will only be added to north and south facades. North and south facades can be +/- 30 degrees of north and south. East and west facades will only receive view windows. Mechanical rooms won't relieve any view or daylight windows. Kitchens and Restrooms wont' receive any view windows. Skylights will be added when possible to gyms, libraries, and cafeterias. In spaces with skylights senors will be at the center of the space, in sidelight spaces the sensor's depth in from the wall will typically be the same as the height of the wall that the daylight windows is on. This depth is also what is used to calculate the daylight fraction of the space. In spaces that are non convex, such as an L shaped space, we may not be able to place a sensor, if that happens a warning will be issued.",
  "description_xml": "This measure will remove all existing exterior windows, glass doors, and skylights from your model. They will be replaced with view and daylight windows as recommended by the K12 AEDG recommendations. Windows on the south facade will have a exterior shading or light shelf surfaces depending on if they are view or daylight windows. East and west view windows will have internal shading controls. In spaces with daylighting controls daylight sensor will be added. The modeler should inspect where the sensors were placed, the recommended illuminance setpoint, and the fraction of the zones lighting controlled by the sensor."
}